<?php

namespace App\Console\Commands;

use Illuminate\Console\Command;
use Illuminate\Support\Facades\Storage;

class PrepareData extends Command
{
    /**
     * The name and signature of the console command.
     *
     * @var string
     */
    protected $signature = 'prepare:data';

    /**
     * The console command description.
     *
     * @var string
     */
    protected $description = 'Prepare data for the database';

    /**
     * Execute the console command.
     *
     * @return int
     */
    public function handle()
    {
        $arr = [
            '1694' =>    "イチネンケミカルズ",
            '1829' =>    "ＩＫＡ",
            '3528' =>    "佐藤ケミカル",
            '8214' =>    "吉田製油所",
            '2478' =>    "共和ゴム",
            '1938' =>    "エムテートリマツ",
            '3752' =>    "ＳＰＲｉＮＴＵＳ",
            '5340' =>    "ネオプレーン",
            '1912' =>    "ＵＹＥＫＩ",
            '7337' =>    "前田道路",
            '3636' =>    "祥碩堂",
            '1963' =>    "ＮＢＷ",
            '1995' =>    "オーミケンシ",
            '2848' =>    "ＫＯＫＵＧＯ",
            '3641' =>    "Ｇ．Ｇ．",
            '6837' =>    "ヘルメチック",
            '1832' =>    "ｉｎｏｍａｔａ",
            '8455' =>    "和協産業",
            '1878' =>    "ＵｌｔｉＭａｋｅｒ",
            '7345' =>    "マツヨシ",
            '3764' =>    "シーマスター",
            '6537' =>    "ＨＥＡＲＴ",
            '8267' =>    "山仁薬品",
            '1881' =>    "ＥＸＰＬＯＲＥＲ",
            '2590' =>    "クリーンマスター",
            '1767' =>    "アオヤギ",
            '1688' =>    "アーヴァン",
            '7352' =>    "ＭａｋｅｒＢｏｔ",
            '1696' =>    "あゆみ",
            '2851' =>    "児玉兄弟商会",
            '3771' =>    "新生",
            '8277' =>    "Ｒａｐｉｄ",
            '2393' =>    "ＫＡＮパテ",
            '4492' =>    "大額",
            '6762' =>    "ＰＲＯＭＯＴＥ",
            '6499' =>    "Ｐｅｒｍａｔｅｘ",
            '6565' =>    "ハクキンカイロ",
            '5338' =>    "日本ピラー",
            '2555' =>    "空調風神服",
            '4478' =>    "ダイオーミウラ",
            '2832' =>    "コットン・ラボ",
            '1686' =>     "アシスト",
            '3861' =>     "ＳＯＷＡ",
            '8912' =>     "ルミカライト",
            '3777' =>     "信和",
            '6652' =>     "ＦＲＥＥＰＡ",
            '1741' =>     "アイグネップ",
            '1756' =>     "青木製作所",
            '3774' =>     "ジャストＣｏｒｐ．",
            '2854' =>     "コクサイ",
            '4541' =>     "ツネミ",
            '6566' =>     "ＢＡＳＦ",
            '6538' =>     "ハイランド",
            '1752' =>     "Ａｐｉｋａａ",
            '3624' =>     "ステルスマウント",
            '7457' =>     "モトコマ",
            '4486' =>     "高島産業",
            '2485' =>     "Ｃｒｏｓｓ−ｆａｎ",
            '2600' =>     "ＫＢＩＳ",
            '6909' =>     "防災人",
            '6651' =>     "ブルマン",
            '2475' =>     "九州ハセック",
            '1932' =>     "ＳＭＫ",
            '3487' =>     "ＳＡＮＫＥＩ",
            '4545' =>     "ＴＥＫＮＯＳ",
            '1914' =>     "エヌピーエー",
            '2588' =>     "ＣＲＯＷＮ",
            '1661' =>     "ディゾルビット",
            '6557' =>     "ＰＬＡｎｅｘ",
            '3824' =>     "セキド",
            '4495' =>     "Ｄｉａｔｒｅｎｄ",
            '7298' =>     "ＭＣＯ",
            '3115' =>     "伸榮",
            '4514' =>     "大東プレス",
            '6536' =>     "ハロー",
            '6658' =>     "ドクターベックマン",
            '3525' =>     "シルキー",
            '2396' =>     "ＧＡＬＬＩＵＭ",
            '3780' =>     "伸興電線",
            '6527' =>     "平和電機",
            '1917' =>     "エネタンポ",
            '8275' =>     "ｆｉＳｅｒｉｅｓ",
            '3782' =>     "ＳｃａｎＳｎａｐ",
            '3787' =>     "スタンダード",
            '7339' =>     "三高サプライ",
            '8273' =>     "リビィ",
            '3778' =>     "ＧＦＯＲＣＥ",
            '7336' =>     "ＭＡＳＴＥＲ−ＴＯ",
            '2481' =>     "キリウス",
            '6917' =>     "本多電子",
            '8280' =>     "ライフハンマー",
            '2849' =>     "ＫＯＭＡＤＲＩＬＬ",
            '6558' =>     "ハイコロック",
            '4660' =>     "東京ニホス",
            '8276' =>     "山本科学工具",
            '1770' =>     "ｉＦＬＹＴＥＫ",
            '6599' =>     "フジカラー",
            '6653' =>     "ＰＲＩＭＵＳ",
            '1740' =>     "アイ・エス",
            '3779' =>     "ＪＡＰＡＮＮＥＸＴ",
            '3765' =>     "ＪＡＰＡＮＳＡＬＴ",
            '7394' =>     "プラリペア",
            '2853' =>     "小林工具製作所",
            '2479' =>     "キシマ",
            '4578' =>     "帝金",
            '1921' =>     "ＯＭデジタル",
            '4496' =>     "ダイナミックツール",
            '8281' =>     "リトルツリーズ",
            '4668' =>     "ＭＱ・Ｄｕｏｔｅｘ",
            '7395' =>     "ムラマツ",
            '7342' =>     "ＭｉｒａｉＳｅｌｌ",
            '6603' =>     "フォトプロ",
            '7347' =>     "ＭＡＧ",
            '5339' =>     "新潟電子工業",
            '8256' =>     "ＬＥＡＢＬＥ",
            '4120' =>     "ツノダ",
            '5321' =>     "Ｎｏｘｕｄｏｌ",
            '2457' =>     "ＱＢＲＩＣＫ",
            '4655' =>     "東京計装",
            '2553' =>     "グリニッジＰОＬО",
            '6554' =>     "東尾メック",
            '2797' =>     "コダック",
            '6758' =>     "Ｐｌａｉｓｉｒ",
            '6835' =>     "プラス・テク",
            '4576' =>     "ＴＥＲＡＤＡ",
            '3512' =>     "ＳＡＮＫＥＩ",
            '1951' =>     "ＳＣ",
            '2795' =>     "国際電業",
            '3527' =>     "サニー",
            '3762' =>     "新北九州工業",
            '4497' =>     "ＴＰ技研",
            '1738' =>     "ＩＭＰＡＣＴＰＲＯ",
            '4662' =>     "ｔｒａｎｇｉａ",
            '2796' =>     "ＫＯＹＯＥＮＧ",
            '4661' =>     "ＴＳＫ",
            '6555' =>     "バイキングアーム",
            '6639' =>     "ＶｅｇｉｅＢＡＧ",
        ];

        $str = '';
        foreach ($arr as $key => $value) {
            $str .= sprintf("('%s', 1, '%s'),\n", $key, $value);
        }

        Storage::put('trusco_manufacturer_mapping.sql', $str);
    }
}
